'''Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
   На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
   Кількість символів в блоках - та, яка введена в другому параметрі.
   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі
   (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці
   середнього блоку символів?). В репозиторій додайте і ті файли, по яким робили тести.
   Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане
   "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість. В разі необхідності заокруглення
   одного чи обох параметрів - дивіться на свій розсуд.'''

class BadNumber(Exception):
    def __init__(self, msg):
        self.msg = msg

def three_blocks(file_name, number):
    result = []
    text = open(file_name, 'r')
    length = len(text.read())   #длинна текста
    sd_1 = ((length // 2) - number - (number // 2)) #первый сдвиг до центра
    sd_2 = (length - (number * 3) - sd_1)   # второй сдвиг от центра
    if (length // 2) < number:
        raise BadNumber('Число больше рядка!')
    text.close()

    text = open(file_name, 'rb')
    l1 = text.read(number)
    result.append(l1.decode('utf-8'))
    text.seek(sd_1, 1)
    l2 = text.read(number)
    result.append(l2.decode('utf-8'))
    text.seek(sd_2, 1)
    l3 = text.read(number)
    result.append(l3.decode('utf-8'))
    return result



a = three_blocks('test.txt', 8)
print(a)



