'''Створiть 3 рiзних функцiї (на ваш вибiр).
Кожна з цих функцiй повинна повертати якийсь результат.
Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi,
обробляє повернутий ними результат та також повертає результат.
Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3'''

# скрипт ищет разность между умножением двух чисел и суммой этих же чисел
def summ(a, b):
    return a + b

def mul(a, b):
    return a * b

def diff(a, b):
    return b - a

def dif_of_mul_and_summ(a, b):
    numb1 = summ(a, b)
    numb2 = mul(a, b)
    return diff(numb1, numb2)

c = dif_of_mul_and_summ(3, 5)
print(c)
