'''Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність
(рядок, список, кортеж) і повертає генератор, який буде вертати значення з цієї послідовності, при цьому,
якщо було повернено останній елемент із послідовності - ітерація починається знову.
for elem in generator([1, 2, 3]):
   ...    print(elem)
   ...
   1
   2
   3
   1
   2
   3
   1
   .......'''

def generator(element):
    while True:
        for i in element:
            yield i

for i in generator([1, 3, 5, 8, 12]):
    print(i)
