'''Написати функцію < bank > , яка працює за наступною логікою:
користувач робить вклад у розмірі < a > одиниць строком
на < years > років під < percents > відсотків (кожен рік сума вкладу
збільшується на цей відсоток, ці гроші додаються до суми вкладу і в наступному
році на них також нараховуються відсотки). Параметр < percents > є
необов'язковим і має значення по замовчуванню < 10 > (10%).
Функція повинна принтануть і вернуть суму, яка буде на рахунку.'''

def bank(money, years, percent=10):
    buffer_money = money
    for i in range(years):
        buffer_money += (buffer_money * percent) / 100
    print(buffer_money)
    return buffer_money

bank(100, 5)
bank(100, 5, 30)
