'''Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів
в списку. Тобто, функція приймає два аргументи: список і величину зсуву
(якщо ця величина додатня - пересуваємо з кінця на початок, якщо
від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).'''

def shift(arr, shift):
    if shift > 0:
        for i in range(shift):
            arr.insert(0, arr.pop())
    elif shift < 0:
        for i in range(sfift * -1):
            arr.append(arr.pop(0))
    else:
        return arr
    return arr

print(shift([1, 2, 3, 4, 5 ,6 ,7 ,8 ,9], 5))
print(shift([1, 2, 3, 4, 5 ,6 ,7 ,8 ,9], -3))
